(load "../rules.scm")
(load "golden")
(load "input")



(սահմանել (եռանկյունաձև֊տեսք մատրից)
	(կատարել
	(վերագրել տ (երկարություն մատրից)) 
	(վերագրել ս (երկարություն (ստանալ մատրից 0))) 
	(կրկնել (ժ  0  տ)
	(կրկնել (ի  0  տ)
	(երբ (ժխտում (= ի ժ))
	(կատարել
		(վերագրել ա (* 1.0 (ստանալ (ստանալ  մատրից ի) ժ)))
		(վերագրել բ (* 1.0 (ստանալ (ստանալ  մատրից ժ) ժ)))
		(վերագրել գ (/ ա բ ))
		(կրկնել (դ 0 ս)
			(վերագրել արժեք (- (ստանալ (ստանալ  մատրից ի) դ) (* գ (ստանալ (ստանալ  մատրից ժ) դ)) )) 
			(վերագրել մատրից (տալ֊արժեք մատրից ի դ արժեք )))))))
			մատրից))
		 
 

(սահմանել (կա֊զրոյական֊տող մատրից)
	(կատարել
	(վերագրել տ (երկարություն մատրից)) 
	(վերագրել ս (երկարություն (ստանալ մատրից 0))) 
	(կրկնել (ի  0  տ)
	(կատարել
	(վերագրել ա 1) 
	(կրկնել (ժ  0  ս)
	(երբ (ժխտում ( = (ստանալ (ստանալ  մատրից ի) ժ) 0 )) 
		(վերագրել ա 0)))
	(երբ ( = ա 0)
		0)))
		1))
			



(սահմանել (գաուս մատրից)
	(կատարել
	(վերագրել արդյունք '())
	(վերագրել տ (երկարություն մատրից)) 
	(վերագրել եռանկյուն֊մատրից (եռանկյունաձև֊տեսք մատրից))
	(վերագրել ստուգում (կա֊զրոյական֊տող մատրից))
	;(տպել ստուգում)(նորտող)
	(երբ (ժխտում ( = ստուգում 0))
		(կրկնել (ի  0  տ)
			(վերագրել անհայտ ( / (ստանալ (ստանալ  եռանկյուն֊մատրից ի) տ) (ստանալ (ստանալ  եռանկյուն֊մատրից ի) ի)))
		(վերագրել արդյունք (ավելացնել (ցուցակ անհայտ) արդյունք))))
		(շրջել արդյունք)))
		 
 (սահմանել (ստուգում֊գաուս մատրից արդյունք)
 	(եթե (հավասար (գաուս մատրից) արդյունք)
		ապա (գաուս մատրից)
		այլապես "Լուծումը սխալ է"))
 



(կրկնել (ի 0 (երկարություն ակնկալվող)) 
 	(կատարել 
 	(վերագրել զանգված (ստանալ մուտքային ի))
 	(վերագրել տող (երկարություն (ստանալ մուտքային ի)))
 	(վերագրել սյուն (երկարություն (ստանալ (ստանալ մուտքային ի) 0)))
	(վերագրել մատրից (ստեղծել֊մատրից  տող սյուն զանգված))
 	(տպել (ստուգում֊գաուս  մատրից (ստանալ ակնկալվող ի)))
 	))
 
 
 
 
 
 
